@shrsr,

thanks for the quick reply. I tried using the id and unfortunately it failed.
This is the output from creating the interfaces. I'm creating a VPC port-channel on 2 leaf switches.
```
my_port_list = {
  "testserver_dialog_1" = {
    "admin_state" = "up"
    "annotation" = "orchestrator:terraform"
    "breakout" = ""
    "description" = ""
    "id" = "uni/infra/portconfnode-1101-card-1-port-2-sub-0"
    "interface" = "1/2/0"
    "name_alias" = tostring(null)
    "node" = 1101
    "pc_member" = ""
    "policy_group" = "uni/infra/funcprof/accbundle-vpc_testserver1_ipg"
    "port_type" = "access"
    "role" = "leaf"
  }
  "testserver_dialog_2" = {
    "admin_state" = "up"
    "annotation" = "orchestrator:terraform"
    "breakout" = ""
    "description" = ""
    "id" = "uni/infra/portconfnode-1102-card-1-port-2-sub-0"
    "interface" = "1/2/0"
    "name_alias" = tostring(null)
    "node" = 1102
    "pc_member" = ""
    "policy_group" = "uni/infra/funcprof/accbundle-vpc_testserver1_ipg"
    "port_type" = "access"
    "role" = "leaf"
  }
}

```

Using the id when configuring a static_port I got this error message:

Terraform will perform the following actions:

```
  # aci_epg_to_static_path.test_port will be created
  + resource "aci_epg_to_static_path" "test_port" {
      + annotation         = "annotation"
      + application_epg_dn = "uni/tn-feld09-tf_ten/ap-back_ap/epg-port_test"
      + description        = (known after apply)
      + encap              = "vlan-18"
      + id                 = (known after apply)
      + instr_imedcy       = "lazy"
      + mode               = "regular"
      + primary_encap      = (known after apply)
      + tdn                = "uni/infra/portconfnode-1101-card-1-port-2-sub-0"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aci_epg_to_static_path.test_port: Creating...
╷
│ Error: Invalid target DN: uni/infra/portconfnode-1101-card-1-port-2-sub-0
│ 
│   with aci_epg_to_static_path.test_port,
│   on main.tf line 102, in resource "aci_epg_to_static_path" "test_port":
│  102: resource "aci_epg_to_static_path" "test_port" {
│ 
╵

```

Dirk
